'''
다리놓기

메모이제이션 사용하면 될 것 같다. 
점화식을 써야하는데...


3 - 2 = 1

101
110

011

4 - 2 = 2
1001
1010
1100

0101
0110

0011

5 - 2 = 3
10001
10010
10100
11000

01001
01010
01100

00101
00110

00011

5 - 3 = 2
10011
10110
11100
10101
11010
11001

01011
01110
01101

00111

4,2 = 3,2 + 3,1

5,3 = 

1001
1010
1100

0101
0110

0011


1011
1101
1110

0111



5,3 = 4,3 + 4,2

5,3 = 4,3 + 4,2 + 4,1

5,2 = 4,1 + 4,2

5,1 = 4,0 + 4,1

점화식

N, M = N-1, M-1 + N-1, M

'''
dp = [[0] * 30 for _ in range(30)]

for i in range(30):
    dp[i][0] = 1
    dp[0][i] = 1
    dp[i][i] = 1
    dp[i][1] = i
    dp[1][i] = i

for i in range(1, 30):
    for j in range(1, 30):
        if dp[i][j] == 0:
            dp[i][j] += dp[i-1][j-1] + dp[i-1][j] 

T = int(input())

for i in range(T):
    lst = list(map(int, input().split()))
    A = max(lst)
    B = min(lst)
    print(dp[A][B])